HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xb/IfxCbs_regdef.h
/** \\brief  TG Capture for Cores - HALT */
typedef struct _Ifx_CBS_TCCH_Bits
{
    unsigned int C0:1;                      /**< \brief [0:0] Capture of HALT Signal of CPU0 (rh) */
    unsigned int C1:1;                      /**< \brief [1:1] Capture of HALT Signal of CPU1 (rh) */
    unsigned int C2:1;                      /**< \brief [2:2] Capture of HALT Signal of CPU2 (rh) */
    unsigned int reserved_3:28;             /**< \brief \internal Reserved */
    unsigned int HSM:1;                     /**< \brief [31:31] Capture of HALT Signal of HSM (rh) */
} Ifx_CBS_TCCH_Bits;

/** \\brief  TG Capture for TG Input Pins */
typedef struct _Ifx_CBS_TCIP_Bits
{
    unsigned int P0:1;                      /**< \brief [0:0] Capture of Trigger Input Pin 0 (rh) */
    unsigned int P1:1;                      /**< \brief [1:1] Capture of Trigger Input Pin 1 (rh) */
    unsigned int P2:1;                      /**< \brief [2:2] Capture of Trigger Input Pin 2 (rh) */
    unsigned int P3:1;                      /**< \brief [3:3] Capture of Trigger Input Pin 3 (rh) */
    unsigned int P4:1;                      /**< \brief [4:4] Capture of Trigger Input Pin 4 (rh) */
    unsigned int P5:1;                      /**< \brief [5:5] Capture of Trigger Input Pin 5 (rh) */
    unsigned int P6:1;                      /**< \brief [6:6] Capture of Trigger Input Pin 6 (rh) */
    unsigned int P7:1;                      /**< \brief [7:7] Capture of Trigger Input Pin 7 (rh) */
    unsigned int reserved_8:24;             /**< \brief \internal Reserved */
} Ifx_CBS_TCIP_Bits;

/** \\brief  TG Capture for MCDS */
typedef struct _Ifx_CBS_TCM_Bits
{
    unsigned int BRK:1;                     /**< \brief [0:0] Capture of MCDS break_out (rh) */
    unsigned int SUS:1;                     /**< \brief [1:1] Capture of MCDS suspend_out (rh) */
    unsigned int reserved_2:6;              /**< \brief \internal Reserved */
    unsigned int T0:1;                      /**< \brief [8:8] Capture of MCDS trig_out 0 (rh) */
    unsigned int T1:1;                      /**< \brief [9:9] Capture of MCDS trig_out 1 (rh) */
    unsigned int T2:1;                      /**< \brief [10:10] Capture of MCDS trig_out 2 (rh) */
    unsigned int T3:1;                      /**< \brief [11:11] Capture of MCDS trig_out 3 (rh) */
    unsigned int reserved_12:20;            /**< \brief \internal Reserved */
} Ifx_CBS_TCM_Bits;

/** \\brief  TG Capture for OTGB0/1 */
typedef struct _Ifx_CBS_TCTGB_Bits
{
    unsigned int OTGB0:16;                  /**< \brief [15:0] Capture Bits for OTGB0 (rh) */
    unsigned int OTGB1:16;                  /**< \brief [31:16] Capture Bits for OTGB1 (rh) */
} Ifx_CBS_TCTGB_Bits;

/** \\brief  TG Capture for TG Lines */
typedef struct _Ifx_CBS_TCTL_Bits
{
    unsigned int reserved_0:1;              /**< \brief \internal Reserved */
    unsigned int TL1:1;                     /**< \brief [1:1] Capture of Trigger Line 1 (rh) */
    unsigned int TL2:1;                     /**< \brief [2:2] Capture of Trigger Line 2 (rh) */
    unsigned int TL3:1;                     /**< \brief [3:3] Capture of Trigger Line 3 (rh) */
    unsigned int TL4:1;                     /**< \brief [4:4] Capture of Trigger Line 4 (rh) */
    unsigned int TL5:1;                     /**< \brief [5:5] Capture of Trigger Line 5 (rh) */
    unsigned int TL6:1;                     /**< \brief [6:6] Capture of Trigger Line 6 (rh) */
    unsigned int TL7:1;                     /**< \brief [7:7] Capture of Trigger Line 7 (rh) */
    unsigned int reserved_8:24;             /**< \brief \internal Reserved */
} Ifx_CBS_TCTL_Bits;

/** \\brief  TG Input Pins Routing */
typedef struct _Ifx_CBS_TIPR_Bits
{
    unsigned int PIN0:4;                    /**< \brief [3:0] Trigger Pin 0 to Trigger Line Routing (rw) */
    unsigned int PIN1:4;                    /**< \brief [7:4] Trigger Pin 1 to Trigger Line Routing (rw) */
    unsigned int PIN2:4;                    /**< \brief [11:8] Trigger Pin 2 to Trigger Line Routing (rw) */
    unsigned int PIN3:4;                    /**< \brief [15:12] Trigger Pin 3 to Trigger Line Routing (rw) */
    unsigned int PIN4:4;                    /**< \brief [19:16] Trigger Pin 4 to Trigger Line Routing (rw) */
    unsigned int PIN5:4;                    /**< \brief [23:20] Trigger Pin 5 to Trigger Line Routing (rw) */
    unsigned int PIN6:4;                    /**< \brief [27:24] Trigger Pin 6 to Trigger Line Routing (rw) */
    unsigned int PIN7:4;                    /**< \brief [31:28] Trigger Pin 7 to Trigger Line Routing (rw) */
} Ifx_CBS_TIPR_Bits;

/** \\brief  TG Line 1 Suspend Targets */
typedef struct _Ifx_CBS_TL1ST_Bits
{
    unsigned int C0:1;                      /**< \brief [0:0] CPU0 as Suspend Target (rw) */
    unsigned int C1:1;                      /**< \brief [1:1] CPU1 as Suspend Target (rw) */
    unsigned int C2:1;                      /**< \brief [2:2] CPU2 as Suspend Target (rw) */
    unsigned int reserved_3:25;             /**< \brief \internal Reserved */
    unsigned int HSS:1;                     /**< \brief [28:28] HSSL as Suspend Target (rw) */
    unsigned int DMA:1;                     /**< \brief [29:29] DMA as Suspend Target (rw) */
    unsigned int reserved_30:1;             /**< \brief \internal Reserved */
    unsigned int HSM:1;                     /**< \brief [31:31] HSM as Suspend Target (rw) */
} Ifx_CBS_TL1ST_Bits;

/** \\brief  TG Line Control */
typedef struct _Ifx_CBS_TLC_Bits
{
    unsigned int reserved_0:4;              /**< \brief \internal Reserved */
    unsigned int TLSP1:4;                   /**< \brief [7:4] TG Line Signal Processing (rw) */
    unsigned int TLSP2:4;                   /**< \brief [11:8] TG Line Signal Processing (rw) */
    unsigned int TLSP3:4;                   /**< \brief [15:12] TG Line Signal Processing (rw) */
    unsigned int TLSP4:4;                   /**< \brief [19:16] TG Line Signal Processing (rw) */
    unsigned int TLSP5:4;                   /**< \brief [23:20] TG Line Signal Processing (rw) */
    unsigned int TLSP6:4;                   /**< \brief [27:24] TG Line Signal Processing (rw) */
    unsigned int TLSP7:4;                   /**< \brief [31:28] TG Line Signal Processing (rw) */
} Ifx_CBS_TLC_Bits;

/** \\brief  TG Line Counter Control */
typedef struct _Ifx_CBS_TLCC_Bits
{
    unsigned int TGL:4;                     /**< \brief [3:0] Trigger Line to Counter Routing (rw) */
    unsigned int LE:3;                      /**< \brief [6:4] Level or Edge Counting (rw) */
    unsigned int reserved_7:1;              /**< \brief \internal Reserved */
    unsigned int CLR:2;                     /**< \brief [9:8] Clear and Enable Counter(s) (w) */
    unsigned int reserved_10:2;             /**< \brief \internal Reserved */
    unsigned int STOP:2;                    /**< \brief [13:12] Stop Counter(s) (w) */
    unsigned int reserved_14:18;            /**< \brief \internal Reserved */
} Ifx_CBS_TLCC_Bits;

/** \\brief  TG Line Capture and Hold Enable */
typedef struct _Ifx_CBS_TLCHE_Bits
{
    unsigned int reserved_0:1;              /**< \brief \internal Reserved */
    unsigned int TL1:1;                     /**< \brief [1:1] Capture and Hold Enable for Trigger Line 1 (rw) */
    unsigned int TL2:1;                     /**< \brief [2:2] Capture and Hold Enable for Trigger Line 2 (rw) */
    unsigned int TL3:1;                     /**< \brief [3:3] Capture and Hold Enable for Trigger Line 3 (rw) */
    unsigned int reserved_4:28;             /**< \brief \internal Reserved */
} Ifx_CBS_TLCHE_Bits;

/** \\brief  TG Line Capture and Hold Clear */
typedef struct _Ifx_CBS_TLCHS_Bits
{
    unsigned int reserved_0:1;              /**< \brief \internal Reserved */
    unsigned int TL1:1;                     /**< \brief [1:1] Capture and Hold Clear for Trigger Line 1 (w) */
    unsigned int TL2:1;                     /**< \brief [2:2] Capture and Hold Clear for Trigger Line 2 (w) */
    unsigned int TL3:1;                     /**< \brief [3:3] Capture and Hold Clear for Trigger Line 3 (w) */
    unsigned int reserved_4:28;             /**< \brief \internal Reserved */
} Ifx_CBS_TLCHS_Bits;

